application/app/Http/Middleware/General/BootTheme.php

    public function handle($request, Closure $next) {

        //do not run this for SETUP path
        if (env('SETUP_STATUS') != 'COMPLETED') {
            //set default theme
            config([
                'theme.selected_theme_css' => 'public/themes/default/css/style.css?v=1',
            ]);
            //skip this middlware
            return $next($request);
        }

        //get settings
        $settings = \App\Models\Settings::find(1);
---
select * from `settings` where `settings`.`settings_id` = 1 limit 1