application/app/Models/CustomTicket.php

select * from `users` where `id` in ('4')
---
    public function assignedUsers()
    {
        // Get the assigned user IDs (an array)
        $assignedIds = $this->assigned ?? [];
        // Fetch users based on the assigned user IDs
        return User::whereIn('id', $assignedIds)->get();