application/app/Http/Middleware/Landlord/BootMail.php

select * from `settings` where `settings_id` = 'default' limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Signature' limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Footer' limit 1
---
    public function handle($request, Closure $next) {

        //do not run this for SETUP path
        if (env('SETUP_STATUS') != 'COMPLETED') {
            return $next($request);
        }

        //get settings
        $settings = \App\Models\Landlord\Settings::Where('settings_id', 'default')->first();

        //defaults
        $email_signature = '';
        $email_footer = '';

        //get email signature
        if ($template = \App\Models\Landlord\EmailTemplate::Where('emailtemplate_name', 'Email Signature')->first()) {
            $email_signature = $template->emailtemplate_body;
        }

        //get email footer
        if ($template = \App\Models\Landlord\EmailTemplate::Where('emailtemplate_name', 'Email Footer')->first()) {