application/app/Http/Middleware/Landlord/BootSystem.php

    public function customerDefaults() {

        //get landlord settings
        $defaults = \App\Models\Landlord\Defaults::Where('defaults_id', 1)->first();
---
select * from `defaults` where `defaults_id` = 1 limit 1

    public function systemSettings() {

        //get the general settings
        $settings = \App\Models\Landlord\Settings::Where('settings_id', 'default')->first();
        $this->settings = $settings;

        //set timezone
        // date_default_timezone_set($settings->settings_system_timezone);

        //currency symbol position setting
        // if ($settings->settings_system_currency_position == 'left') {
        //     $settings['currency_symbol_left'] = $settings->settings_system_currency_symbol;
        //     $settings['currency_symbol_right'] = '';
        // } else {
        //     $settings['currency_symbol_right'] = $settings->settings_system_currency_symbol;
        //     $settings['currency_symbol_left'] = '';
        // }

        //cronjob path
        $settings['cronjob_path'] = '/usr/local/bin/php ' . BASE_DIR . '/application/artisan schedule:run >> /dev/null 2>&1';

        //javascript file versioning to avoid caching when making updates
        // $settings['versioning'] = $settings->settings_system_javascript_versioning;

        //count tenant with pending email settings
        $settings['count_tenant_email_config_status'] = \App\Models\Landlord\Tenant::where('tenant_email_config_status', 'pending')->count();
---
select * from `settings` where `settings_id` = 'default' limit 1
select count(*) as aggregate from `tenants` where `tenant_email_config_status` = 'pending'