application/app/Http/Controllers/TicketController.php

    public function create() {

            // Batch requests for better performance
             $requests  = [
                'loadType'          => 'App\Models\CTicketLoadType',
                'countries'         => 'App\Models\CTicketCountry',
                'transportChannels' => 'App\Models\CTicketTransportChannel',
                'carriageType'      => 'App\Models\CTicketCarriageType',
                'orderTypes'        => 'App\Models\CTicketOrderType',
                'orderStatus'       => 'App\Models\CTicketStatus',
                'incoterms'         => 'App\Models\CTicketIncoterms',
             ];
            // Batch processing of requests
            $responses = [];
            foreach ($requests as $key => $requestUrl) {
                $responses[$key] = $this->fetchData($requestUrl);
            }

            $page               = $this->pageSettings('create');
            $loadType           = $responses['loadType']?? null;
            $countries          = $responses['countries']?? null;
            $transportChannels  = $responses['transportChannels']?? null;
            $carriageType       = $responses['carriageType']?? null;
            $orderTypes         = $responses['orderTypes']?? null;
            $orderStatus        = $responses['orderStatus']?? null;
            $incoterms          = $responses['incoterms']?? null;
            $assigned           = User::where('id','!=',auth()->user()->id)->get();
---
select * from `users` where `id` != 1

    public function store(Request $request) {


        //dd($request->all());

        $goods = [];
        $goods = $request->goods;

        unset($request['goods']);
        unset($request['totalQuantity']);
        unset($request['totalWeight']);
        unset($request['totalLDM']);
        unset($request['totalVolume']);
        unset($request['system_language']);
        unset($request['user_has_due_reminder']);
        unset($request['resource_query']);
        unset($request['system_languages']);
        unset($request['projects_menu_list']);
        unset($request['visibility_left_menu_toggle_button']);


        $createTicket = CustomTicket::create($request->all());

        if(isset($goods) && count($goods) > 0 && isset($createTicket->id)){

                foreach($goods as $good){
                    $good['ticket_id'] = $createTicket->id;
                    $createGoods = CTicketGood::create($good);
---
insert into `ctickets` (`ticket_transport_channel_id`, `ticket_status_id`, `ticket_type_id`, `ticket_order_type_id`, `ticket_incoterms_id`, `ticket_loadtype_id`, `quantity`, `assigned`, `shipping_date`, `shipping_time`, `shipper_name`, `shipping_country_id`, `shipping_city`, `shipping_index`, `shipping_address`, `origin`, `pickupRemarks`, `def_shipping`, `def_shipper_name`, `def_shipping_country_id`, `def_shipping_city`, `def_shipping_index`, `def_shipping_address`, `delivery_date`, `delivery_time`, `consignee_name`, `delivery_country_id`, `delivery_city`, `delivery_index`, `delivery_address`, `destination`, `deliveryRemarks`, `def_delivery`, `def_delivery_name`, `def_delivery_country_id`, `def_delivery_city`, `def_delivery_index`, `def_delivery_address`, `temp_sensitive`, `temp_range`, `adr`, `un_code`, `fragile`, `notes`, `chargeable_weight_total`, `updated_at`, `created_at`) values ('', '4', '50', '2', '1', '1', '945', '[\"4\"]', '2024-07-31', '21:11', 'Tatum Frost', '55', 'Minima distinctio N', '83', 'Faisalabad, Pakistan', 'null', '[\"Voluptas esse aliqu\"]', '', '', 'Afghanistan - AF', '', '', '', '2024-07-09', '21:46', 'Mark Wiley', '119', 'A minim incididunt e', '26', 'Rawalpindi, Pakistan', 'null', '[\"Eos velit esse cup\"]', '', '', '1', '', '', '', 'yes', 'Dolores esse ab mai', 'no', 'Eum deserunt est quo', 'no', 'Dolore eaque illum', '97', '2024-11-11 11:32:07', '2024-11-11 11:32:07')

            ];

            //record event
            if ($event_id = Event::create($data)) {
---
insert into `events` (`event_creatorid`, `event_item`, `event_item_id`, `event_item_lang`, `event_item_content`, `event_item_content2`, `event_parent_type`, `event_parent_id`, `event_show_item`, `event_show_in_timeline`, `eventresource_type`, `event_notification_category`, `event_updated`, `event_created`) values (1, 'custom-ticket', 0, 'event_opend_ticket', 'Tatum Frost', 'Mark Wiley', 'ticket', 0, 'yes', 'yes', 'project', 'notifications_tickets_activity', '2024-11-11 11:32:07', '2024-11-11 11:32:07')

        $incoterms          = $responses['incoterms']?? null;

        $ticket = CustomTicket::where('id',$id)->first();
        $lead   = Lead::where('ticket_id',$id)->first();
---
select * from `leads` where `ticket_id` = '152' limit 1

        $orderTypes        = $orderTypes;
        $orderStatus       = $orderStatus;
        $incoterms         = $incoterms;
        $assigned          = User::where('id','!=',auth()->user()->id)->get();
---
select * from `users` where `id` != 3

            $incoterms          = $responses['incoterms']?? null;

            $ticket = CustomTicket::where('id',$id)->first();
            $lead   = Lead::where('ticket_id',$id)->first();
---
select * from `leads` where `ticket_id` = '149' limit 1

            $orderTypes        = $orderTypes;
            $orderStatus       = $orderStatus;
            $incoterms         = $incoterms;
            $assigned          = User::where('id','!=',auth()->user()->id)->get();
---
select * from `users` where `id` != 1

    public function convartToLead(Request $request,$id)
    {

            $lead = Lead::where('ticket_id',$id)->first();
---
select * from `leads` where `ticket_id` = '2' limit 1

            $lead->lead_title = $leadTitle;
            $lead->lead_description = $leadDescription;

            if($lead->save() && isset($lead->lead_id)){
---
insert into `leads` (`lead_title`, `lead_description`, `lead_updated`, `lead_created`) values ('Comoros - KM-Norway - NO(31-Jul-1975 - 07-Aug-2006)', '\r\n            <a href=\'{{ urlResource(\'/ctickets/\'.52.\'/edit\') }}\'>Ticket ID : 52</a><br>\r\n            <h6>General Information</h6>\r\n            <p>Outbound, EXW, Test load type, 417</p>\r\n            <p>Aut sint perspiciat</p>\r\n            <h6>Pickup:</h6>\r\n            <p>Aut architecto eveni, &nbsp;   Comoros - KM, &nbsp; Comoros, &nbsp; Explicabo Dolorum e</p>\r\n            <h6>Delivery:</h6>\r\n            <p>Non veniam sint sed, &nbsp; Norway - NO, &nbsp;  Norway, &nbsp; Tempora ipsa praese</p>\r\n            <h6>Goods:</h6>\r\n            <p>1103, &nbsp; 167, &nbsp;  58, &nbsp;  116</p>\r\n            <h6>Additional Information:</h6>\r\n            <p>1, &nbsp; Nesciunt sint nisi, &nbsp;  Fugit velit odio mi, &nbsp;  Dolor enim nisi dolo, &nbsp;  Sapiente dolore qui,  &nbsp;  Culpa quisquam dolo</p>\r\n            ', '2024-10-01 11:38:38', '2024-10-01 11:38:38')

                ];

                //record event
                if ($event_id = Event::create($data)) {
---
insert into `events` (`event_creatorid`, `event_item`, `event_item_id`, `event_item_lang`, `event_item_content`, `event_item_content2`, `event_parent_type`, `event_parent_id`, `event_show_item`, `event_show_in_timeline`, `eventresource_type`, `event_notification_category`, `event_updated`, `event_created`) values (1, 'lead', '1/{\"name\":\"Congo, Republic of the - FI\"}-{\"name\":\"Saint Lucia - LC\"}(2024-09-19 - 2024-09-22)', 'event_closed_leads', '', '', 'leads', 1, 'yes', 'yes', 'project', 'notifications_leads_activity', '2024-10-10 15:12:40', '2024-10-10 15:12:40')

    public function updateTicketDetails(Request $request, $id){

        $goods = [];
        $goods = $request->goods;

        unset($request['goods']);
        unset($request['totalQuantity']);
        unset($request['totalWeight']);
        unset($request['totalLDM']);
        unset($request['totalVolume']);
        unset($request['system_language']);
        unset($request['user_has_due_reminder']);
        unset($request['resource_query']);
        unset($request['system_languages']);
        unset($request['projects_menu_list']);
        unset($request['visibility_left_menu_toggle_button']);


        $updateTicket = CustomTicket::where('id',$id)->update($request->all());

        if(isset($goods) && count($goods) > 0 && isset($updateTicket)){

                $deleteOlds = CTicketGood::where('ticket_id',$id)->delete();

                foreach($goods as $good){
                    $good['ticket_id'] = $id;
                    $updateGoods = CTicketGood::create($good);
---
delete from `ticket_goods` where `ticket_id` = '138'
insert into `ticket_goods` (`quantity`, `unit_type`, `description`, `weight`, `ldm`, `volume`, `length`, `width`, `height`, `ticket_id`, `updated_at`, `created_at`) values ('76.00', 'pallet', 'Enim deserunt quisqu', '52.00', '41.00', '4.00', '67.00', '93.00', '32.00', '138', '2024-11-08 08:38:15', '2024-11-08 08:38:15')