application/app/Http/Controllers/TicketController.php

insert into `ticket_forms` (`share_id`, `expiry_date`, `updated_at`, `created_at`) values ('formIDaa105a32ff797e57d051', '2024-10-17 14:44:41', '2024-10-10 14:44:41', '2024-10-10 14:44:41')
---
    public function generateLink(Request $request)
    {
        // Generate a unique ID
        $uniqueId = 'formID' . bin2hex(random_bytes(10)); // More secure unique ID
        $expiryDate = now()->addDays(7); // Optional expiry date

        // Store the unique ID in the database
        $form = new TicketForm();
        $form->share_id = $uniqueId;
        $form->expiry_date = $expiryDate; // Optional
        $form->save();

insert into `events` (`event_creatorid`, `event_item`, `event_item_id`, `event_item_lang`, `event_item_content`, `event_item_content2`, `event_parent_type`, `event_parent_id`, `event_show_item`, `event_show_in_timeline`, `eventresource_type`, `event_notification_category`, `event_updated`, `event_created`) values (1, 'ticket', 0, 'event_closed_ticket', 'Facilis nisi facere', 'Beatae veniam porro', 'ticket', 0, 'yes', 'yes', 'project', 'notifications_tickets_activity', '2024-09-30 10:22:45', '2024-09-30 10:22:45')
---
            ];

            //record event
            if ($event_id = Event::create($data)) {

select * from `leads` where `ticket_id` = '43' limit 1
---
        $incoterms          = $responses['incoterms']['common'] ?? null;

        $ticket = $responses['ticket'];
        $lead   = Lead::where('ticket_id',$id)->first();